{"head":{"layout":"Post","title":"ReasonML toolchain","route":"reasonml-toolchain","date":"2018-01-30T07:00:00.000Z","tags":["reasonml","reason-react"],"description":"ReasonML advertises itself as Syntax and toolchain for OCaml. In this article, I'll try my best to explain what ReasonML offers to the…"},"body":"<p><a href=\"https://reasonml.github.io/\">ReasonML</a> advertises itself as <strong>Syntax and toolchain for OCaml</strong>. In this article, I'll try my best to explain what ReasonML offers to the OCaml toolchain.</p>\n<h1 id=\"what-is-reasonml\"><a href=\"#what-is-reasonml\" class=\"phenomic-HeadingAnchor\">#</a>What is ReasonML?</h1>\n<p>ReasonML is a new dialect of OCaml which targeted at Javascript developer. It was created by the same people that brought us <a href=\"https://facebook.github.io/react\">React.js</a> as a way to improve how front end developers write code by avoiding lots of bugs caused by Javascript not having a sound type system. For a more in-depth explanation and introduction to ReasonML, you can take a look as <a href=\"http://2ality.com/2017/11/about-reasonml.html\">this series by Dr. Axel Rauschmayer</a></p>\n<h1 id=\"what-do-you-mean-by-a-new-dialect-of-ocaml\"><a href=\"#what-do-you-mean-by-a-new-dialect-of-ocaml\" class=\"phenomic-HeadingAnchor\">#</a>What do you mean by a new dialect of OCaml?</h1>\n<p>Take a look at this diagram (credit to Dr. Axel Rauschmayer):</p>\n<p><img src=\"./reasonml-architechture.png\"></p>\n<p>OCaml's compiler is pretty unique, it's a set of pluggable parts that can be replaced and used together. This allows ReasonML to be a new syntax on top of OCaml toolchain. The only different between ReasonML and OCaml is the syntax. All semantics are the same. <code>refmt</code> turns RE files into OCaml AST so any tools that works with OCaml would work with ReasonML syntax without modification. Some tools like dune (jbuilder) supports ReasonML out-of-the-box, which means it runs <code>refmt</code> for you under the hood.</p>\n<h2 id=\"can-i-use-reasonml-without-refmt\"><a href=\"#can-i-use-reasonml-without-refmt\" class=\"phenomic-HeadingAnchor\">#</a>Can I use ReasonML without <code>refmt</code>?</h2>\n<p>This question pops up a lot on <a href=\"https://discord.gg/reasonml\">Reason Discord channel</a>. Beside turning RE files to OCaml AST, <code>refmt</code> can pretty print your RE files (like gofmt or prettier). People often get confused this feature as <code>refmt</code>'s main functionality. You can disable the pretty print feature but you can't use ReasonML without <code>refmt</code>.</p>\n<h1 id=\"bucklescript\"><a href=\"#bucklescript\" class=\"phenomic-HeadingAnchor\">#</a>Bucklescript</h1>\n<p><a href=\"https://bucklescript.github.io/\">Bucklescript</a> is a backend for OCaml and a seperate project from ReasonML. It was originally started by folks at Bloomberg. It compiles your ReasonML/OCaml code into optimized JS code. Even though being a seperated project from ReasonML, they are are often referenced at a unit. BuckleScript is a critical piece of the ReasonML experience for Web development.</p>\n<h2 id=\"what-is-the-different-between-js_of_ocaml-and-bucklescript\"><a href=\"#what-is-the-different-between-js_of_ocaml-and-bucklescript\" class=\"phenomic-HeadingAnchor\">#</a>What is the different between <code>js_of_ocaml</code> and Bucklescript?</h2>\n<p>Before Bucklescript, there was <code>js_of_ocaml</code> (JSOO) which also compiles OCaml to JS. Even though they have the same goal, they target different use case:</p>\n<ul>\n<li>JSOO helps you compile your existing OCaml project to have it run in the browser with as little code modification as possible. In another words, JSOO targets OCaml folks.</li>\n<li>Bucklescript on the other hand, provide the best tool for interoping between ReasonML/OCaml and JS. It main target is JS folks.</li>\n</ul>\n<p>Furthermore, Bucklescript and JSOO operates at different level in the compiler toolchain.\nYou can learn more about the differences between the two of them <a href=\"https://bucklescript.github.io/docs/en/comparison-to-jsoo.html\">in Bucklescript docs</a>.</p>\n<p><img src=\"./bsb-vs-jsoo.png\" alt=\"Bucklescript vs js_of_ocaml\"></p>\n<p>Bucklescript operates at higher level in the compiler tool chain than JSOO. This means JSOO could use advanced tools to do whole program tree-shaking (I forgot the name). Bucklescript on the other hand, outputting hints that JS bundlers could use for tree-shaking. This isn't ideal but it's already an incredible work by Bucklescript team. Thank you!</p>\n<p>Side note: <a href=\"https://github.com/ocsigen/js_of_ocaml/issues/338\">Bucklescript's Lead developer Hongbo Zhang have shared the ideas of Bucklescript before making it</a>. So I can say that no wheels were invented in the process of making Bucklescript.</p>\n<!--\n# esy - the package manager\n\nReasonML brings esy, a new package manager to the game. Here is a brief explanation about different package managers in the ecosystem:\n\n* opam: The entire ecosystem of native ocaml is built around these opam packages.\n* npm/yarn: The entire ecosystem of JS files are built around this ecosystem.\n* [esy](http://esy.sh): Makes opam feel like npm/yarn. Allows access to both ecosystems.\n\nI'll have a post introducing [esy](http://esy.sh) soon. Stay tuned!\n-->\n<h1 id=\"build-systems\"><a href=\"#build-systems\" class=\"phenomic-HeadingAnchor\">#</a>Build systems</h1>\n<p>Bucklescript actually contains 2 parts: bsb - the build system and bsc - the compiler. They are often referenced as a single unit: Bucklescript to avoid churn. ReasonML bring bsb and bsb-native to the game. Here is some available build systems:</p>\n<ul>\n<li>bsb: Build system for JS projects that are composed of other packages that use bsb.</li>\n<li>bsb-native: Like bsb but also compiles those same kinds of projects to native.</li>\n<li>dune (jbuilder)</li>\n<li>Make/ninja</li>\n<li>webpack/rollup</li>\n</ul>\n<h1 id=\"js-developers\"><a href=\"#js-developers\" class=\"phenomic-HeadingAnchor\">#</a>JS developers</h1>\n<p>It would be a mistake to not mentioning the JS developers ReasonML is bringing to the ecosystem. This helps expanding the user base, push OCaml towards new landscape.</p>\n<h1 id=\"conclusion\"><a href=\"#conclusion\" class=\"phenomic-HeadingAnchor\">#</a>Conclusion</h1>\n<p>ReasonML is a promising project and it's moving really fast. If you want to sleep well at night, try ReasonML. The advanced type system inherited from OCaml with 20 years of development has made it the best option available. It eliminates an entire class of bugs in the JS world related to program types.</p>\n<hr>\n<p>You can reach me via Twitter(<a href=\"https://twitter.com/khoanguyenme\">@khoanguyenme</a>) or <strong>@thangngoc89</strong> on Discord channel.</p>\n","__filename":"reasonml-toolchain/index.md","__url":"/reasonml-toolchain/","__resourceUrl":"/reasonml-toolchain/index.html","__dataUrl":"/reasonml-toolchain/index.html.d2b634ff63154d75a1cb635c0a8b0512.json"}