{"head":{"layout":"Post","title":"Mô hình MVC là gì?","date":"2015-01-04T19:58:21.000Z","tags":["mvc"],"description":"Nếu bạn là một lập trình viên, nhất là lập trình web, sẽ rất khó để bạn có thể xin được việc nếu không biết mô hình MVC. Trong post này…"},"body":"<p>Nếu bạn là một lập trình viên, nhất là lập trình web, sẽ rất khó để bạn có thể xin được việc nếu không biết mô hình MVC. Trong post này mình sẽ trình bày đến các bạn mô hình MVC là gì theo cách hiểu của mình qua một vài dự án sử dụng MVC?</p>\n<h1 id=\"mvc-là-gì\"><a href=\"#mvc-l%C3%A0-g%C3%AC\" class=\"phenomic-HeadingAnchor\">#</a>MVC là gì?</h1>\n<p>MVC là viết tắt của Model – View – Controller. Là một kiến trúc phần mềm hay mô hình thiết kế được sử dụng trong kỹ thuật phần mềm. Nói cho dễ hiểu, nó là mô hình phân bố source code thành 3 phần, mỗi thành phần có một nhiệm vụ riêng biệt và độc lập với các thành phần khác.</p>\n<h1 id=\"các-thành-phần-trong-mvc\"><a href=\"#c%C3%A1c-th%C3%A0nh-ph%E1%BA%A7n-trong-mvc\" class=\"phenomic-HeadingAnchor\">#</a>Các thành phần trong MVC</h1>\n<h2 id=\"controller\"><a href=\"#controller\" class=\"phenomic-HeadingAnchor\">#</a>Controller</h2>\n<p>Giữ nhiệm vụ nhận điều hướng các yêu cầu từ người dùng và gọi đúng những phương thức xử lý chúng… Chẳng hạn thành phần này sẽ nhận request từ url và form để thao tác trực tiếp với Model.</p>\n<h2 id=\"model\"><a href=\"#model\" class=\"phenomic-HeadingAnchor\">#</a>Model</h2>\n<p>Đây là thành phần chứa tất cả các nghiệp vụ logic, phương thức xử lý, truy xuất database, đối tượng mô tả dữ liệu như các Class, hàm xử lý…</p>\n<h2 id=\"view\"><a href=\"#view\" class=\"phenomic-HeadingAnchor\">#</a>View</h2>\n<p>Đảm nhận việc hiển thị thông tin, tương tác với người dùng, nơi chứa tất cả các đối tượng GUI như textbox, images… Hiểu một cách đơn giản, nó là tập hợp các form hoặc các file HTML.</p>\n<h1 id=\"luồng-đi-trong-mvc\"><a href=\"#lu%E1%BB%93ng-%C4%91i-trong-mvc\" class=\"phenomic-HeadingAnchor\">#</a>Luồng đi trong MVC</h1>\n<p>Để giải thích, mình xin dùng 1 ví dụ đơn giản + hình minh họa sau.</p>\n<p><img src=\"/images/2015/01/mo-hinh-mvc.jpg\" alt=\"Mô hình MVC\"></p>\n<p>Khi có một yêu cầu từ phía client gửi đến server, Bộ phận controller có nhiệm vụ nhận yêu cầu, xử lý yêu cầu đó. Và nếu cần, nó sẽ gọi đến phần model, vốn là bộ phần làm việc với Database..</p>\n<p>Sau khi xử lý xong, toàn bộ kết quả được đẩy về phần View. Tại View, sẽ gen ra mã Html tạo nên giao diện, và trả toàn bộ html về trình duyệt để hiển thị.</p>\n<h1 id=\"Ưu-điểm-và-nhược-điểm-của-mvc\"><a href=\"#%C6%AFu-%C4%91i%E1%BB%83m-v%C3%A0-nh%C6%B0%E1%BB%A3c-%C4%91i%E1%BB%83m-c%E1%BB%A7a-mvc\" class=\"phenomic-HeadingAnchor\">#</a>Ưu điểm và nhược điểm của MVC</h1>\n<h2 id=\"1-Ưu-điểm\"><a href=\"#1-%C6%AFu-%C4%91i%E1%BB%83m\" class=\"phenomic-HeadingAnchor\">#</a>1. Ưu điểm</h2>\n<p>Thể hiện tính chuyên nghiệp trong lập trình, phân tích thiết kế. Do được chia thành các thành phần độc lập nên giúp phát triển ứng dụng nhanh, đơn giản, dễ nâng cấp, bảo trì..</p>\n<h2 id=\"2-nhược-điểm\"><a href=\"#2-nh%C6%B0%E1%BB%A3c-%C4%91i%E1%BB%83m\" class=\"phenomic-HeadingAnchor\">#</a>2. Nhược điểm</h2>\n<p>Đối với dự án nhỏ việc áp dụng mô hình MC gây cồng kềnh, tốn thời gian trong quá trình phát triển. Tốn thời gian trung chuyển dữ liệu của các thành phần.</p>\n<h1 id=\"tóm-lại\"><a href=\"#t%C3%B3m-l%E1%BA%A1i\" class=\"phenomic-HeadingAnchor\">#</a>Tóm lại</h1>\n<p>Để lập trình chuyên nghiệp, làm việc trọng một nhóm nhiều người, việc áp dụng mô hình trong thiết kế là điều bắt buộc. MVC là một mô hình khá đơn giản và thích hợp cho những người chưa nhiều kinh nghiệm. Hy vọng qua bài giới thiệu này các bạn có những kiến thức cơ bản về mô hình thiết kế trong làm phần mềm.</p>\n<p>Nguồn : <a href=\"http://laptrinhvien.net/blog/tim-hieu-mo-hinh-mvc-la-gi/\">laptrinhvien.net</a></p>\n","__filename":"tim-hieu-mo-hinh-mvc-la-gi.md","__url":"/tim-hieu-mo-hinh-mvc-la-gi/","__resourceUrl":"/tim-hieu-mo-hinh-mvc-la-gi/index.html","__dataUrl":"/tim-hieu-mo-hinh-mvc-la-gi/index.html.081dc74fe5aef7affc089aaee6da4ae9.json"}